A GUID identifying the Autodesk 360 project to which the model is associated.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public Guid GetProjectGUID()
  Visual Basic
Public Function GetProjectGUID As Guid
  Visual C++
public:
Guid GetProjectGUID()
 See Also
  ModelPath Class
  Autodesk.Revit.DB Namespace